src/Catalogs/АгентыКИПДополнительныеРеквизиты/АгентыКИПДополнительныеРеквизиты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АгентыКИПДополнительныеРеквизиты</name>
  <owners>Catalog.АгентыКИП</owners>
  <attributes>
    <name>ИнформационныеБазыХеш</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольДоступностиИнформационныхБаз</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодКонтроляИнформационнойБазы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйПроцентДоступностиИнформационнойБазы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерБуфераСчетчиковПроизводительности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МониторингКластеров</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИнформационныеБазы</name>
    <attributes>
      <name>ИнформационнаяБаза</name>
      <type>
        <types>CatalogRef.ОбъектыКонтроля</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/КомандыАгентаКИП/КомандыАгентаКИП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КомандыАгентаКИП</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Команда</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатВыполнения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>АгентКИП</name>
    <type>
      <types>CatalogRef.АгентыКИП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипКоманды</name>
    <type>
      <types>EnumRef.ТипыКомандАгентаКИП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусКоманды</name>
    <type>
      <types>EnumRef.СтатусыКомандАгентаКИП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УникальныйИдентификаторЗаписи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НастройкиКонтрольПодключений/НастройкиКонтрольПодключений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиКонтрольПодключений</name>
  <resources>
    <name>МаксимальнаяДатаПрочитанныхЗаписейСкрыто</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>МеханизмПроверкиОбрабатыватьИзменения</name>
    <type>
      <types>EnumRef.МеханизмыПроверкиПодключения</types>
    </type>
  </resources>
  <resources>
    <name>URLОпубликованнойИнформационнойБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьЛогинПриПодключении</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьПарольПриПодключении</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтрокаСоединения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НеПроверятьПоЖурналуРегистрации</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Таймаут</name>
    <comment>Максимальное время выполнения контрольной процедуры</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьПрокси</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПроксиСервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроксиПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодКонтроля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МинимальныйПроцентДоступности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДопустимоНетДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КонтрольнаяПроцедура</name>
    <type>
      <types>CatalogRef.КонтрольныеПроцедуры</types>
      <types>CatalogRef.ВидыКонтрольныхПроцедур</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/БезопасноеХранилище/БезопасноеХранилище.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БезопасноеХранилище</name>
  <resources>
    <name>ДанныеХранилища</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>ВладелецХранилища</name>
    <type>
      <types>CatalogRef.НастройкиАнализаПроблемПроизводительности</types>
      <types>CatalogRef.КонтрольныеПроцедуры</types>
      <types>CatalogRef.Публикации</types>
      <types>CatalogRef.ВидыКонтрольныхПроцедур</types>
      <types>CatalogRef.ВидыОбъектовКонтроля</types>
      <types>String</types>
      <types>CatalogRef.ОбъектыКонтроля</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ТипыКомандАгентаКИП/ТипыКомандАгентаКИП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКомандАгентаКИП</name>
  <comment>Синоним значения используется как ключ соответствия при взаимодействии с агентом</comment>
  <enumValues>
    <name>RemoteControl</name>
    <comment>Синоним используется как ключ соответствия при взаимодействии с агентом</comment>
  </enumValues>
  <enumValues>
    <name>PerformanceMonitor</name>
    <comment>Синоним используется как ключ соответствия при взаимодействии с агентом</comment>
  </enumValues>
  <enumValues>
    <name>AutomationCommand</name>
    <comment>Синоним используется как ключ соответствия при взаимодействии с агентом</comment>
  </enumValues>
  <enumValues>
    <name>Cluster1C</name>
    <comment>Синоним используется как ключ соответствия при взаимодействии с агентом</comment>
  </enumValues>
  <enumValues>
    <name>MainService</name>
    <comment>Синоним используется как ключ соответствия при взаимодействии с агентом</comment>
  </enumValues>
  <enumValues>
    <name>Dumps</name>
  </enumValues>
  <enumValues>
    <name>Ring</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/АгентыКИПДополнительныеРеквизиты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытийОбъекта

Процедура ПередЗаписью(Отказ)
    
    ИнформационныеБазыКонтроля = ЭтотОбъект.ИнформационныеБазы.Выгрузить(,"ИнформационнаяБаза").ВыгрузитьКолонку("ИнформационнаяБаза");
    ИнформационныеБазыХешНовый = ХешИнформационныхБаз(ИнформационныеБазыКонтроля);
    
    Если ДополнительныеСвойства.Свойство("ИнформационныеБазыХешБыл") И ДополнительныеСвойства.ИнформационныеБазыХешБыл <> ИнформационныеБазыХешНовый Тогда
        
        ИнформационныеБазыХеш = ИнформационныеБазыХешНовый;
        ДополнительныеСвойства.Вставить("СформироватьКомандуАгенту", Истина);
        ДополнительныеСвойства.Вставить("ИнформационныеБазыКонтроля", ИнформационныеБазыКонтроля);
        
    Иначе
        
        ДополнительныеСвойства.Вставить("СформироватьКомандуАгенту", Ложь);
        
    КонецЕсли;
    
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
    
    Если ДополнительныеСвойства.СформироватьКомандуАгенту Тогда
        
        ПараметрыКонтроляИнформационныхБаз = КомандаМониторингаДоступностиИнформационныхБаз(ДополнительныеСвойства.ИнформационныеБазыКонтроля);
        
        Команда = Новый Структура;
        Команда.Вставить("infoBaseHash", ИнформационныеБазыХеш);
        Команда.Вставить("settings", ПараметрыКонтроляИнформационныхБаз);
        
        РегистрыСведений.КомандыАгентаКИП.ДобавитьКоманду(ЭтотОбъект.Владелец, Перечисления.ТипыКомандАгентаКИП.RemoteControl, Команда);
        
    КонецЕсли;
    
    Если ДополнительныеСвойства.Свойство("РазмерБуфераСчетчиковПроизводительностиБыл") И ДополнительныеСвойства.РазмерБуфераСчетчиковПроизводительностиБыл <> РазмерБуфераСчетчиковПроизводительности Тогда
        КомандаАгенту = Новый Соответствие;
        КомандаАгенту.Вставить("bufferSize", РазмерБуфераСчетчиковПроизводительности);
        РегистрыСведений.КомандыАгентаКИП.ДобавитьКоманду(ЭтотОбъект.Владелец, Перечисления.ТипыКомандАгентаКИП.PerformanceMonitor, КомандаАгенту);
    КонецЕсли;
            
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ХешИнформационныхБаз(ИнформационныеБазыМассив)
    
    Запрос = Новый Запрос;
    
    Запрос.Текст = "
    |ВЫБРАТЬ
    |   URLОпубликованнойИнформационнойБазы,
    |   МеханизмПроверкиОбрабатыватьИзменения,
    |   БезопасноеХранилище.ДанныеХранилища
    |ИЗ
    |   Справочник.КонтрольныеПроцедуры КАК КонтрольныеПроцедуры
    |ЛЕВОЕ СОЕДИНЕНИЕ
    |   РегистрСведений.НастройкиКонтрольПодключений КАК Настройки
    |ПО
    |   Настройки.КонтрольнаяПроцедура = КонтрольныеПроцедуры.Ссылка
    |ЛЕВОЕ СОЕДИНЕНИЕ
    |   РегистрСведений.БезопасноеХранилище КАК БезопасноеХранилище
    |ПО
    |   БезопасноеХранилище.ВладелецХранилища = КонтрольныеПроцедуры.Ссылка
    |ГДЕ
    |   ОбъектКонтроля В (&ИнформационныеБазы)
    |УПОРЯДОЧИТЬ ПО
    |   КонтрольнаяПроцедура.Ссылка
    |";
    
    Запрос.УстановитьПараметр("ИнформационныеБазы", ИнформационныеБазыМассив);
        
    УстановитьПривилегированныйРежим(Истина);
    Результат = Запрос.Выполнить();
    УстановитьПривилегированныйРежим(Ложь);
            
    ДанныеДляХеша = Новый Массив;
    ДанныеДляХеша.Добавить(Строка(ЭтотОбъект.КонтрольДоступностиИнформационныхБаз));
    
    Выборка = Результат.Выбрать();
    Пока Выборка.Следующий() Цикл
        
        Если ЗначениеЗаполнено(Выборка.ДанныеХранилища) Тогда
            ДанныеХранилища = Выборка.ДанныеХранилища.Получить();
        Иначе
            ДанныеХранилища = Новый Структура("ЛогинПриПодключении, ПарольПриПодключении", "", "");
        КонецЕсли;
        
        ДанныеДляХеша.Добавить(Выборка.URLОпубликованнойИнформационнойБазы);
        ДанныеДляХеша.Добавить(Выборка.МеханизмПроверкиОбрабатыватьИзменения);
        ДанныеДляХеша.Добавить(ДанныеХранилища.ЛогинПриПодключении);
        ДанныеДляХеша.Добавить(ДанныеХранилища.ПарольПриПодключении);
    КонецЦикла;
    
    ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.SHA256);
    ХешированиеДанных.Добавить(СтрСоединить(ДанныеДляХеша, ""));
    
    Возврат СтрЗаменить(Строка(ХешированиеДанных.ХешСумма), " ", "");
        
КонецФункции

Функция КомандаМониторингаДоступностиИнформационныхБаз(ИнформационныеБазыМассив)
    
    Запрос = Новый Запрос;
    
    Запрос.Текст = "
    |ВЫБРАТЬ
    |   КонтрольныеПроцедуры.ОбъектКонтроля КАК ИнформационнаяБаза,
    |   ISNULL(Настройки.URLОпубликованнойИнформационнойБазы, &ПустаяСтрока) КАК URL,
    |   ДанныеХранилища КАК ДанныеХранилища
    |ИЗ
    |   Справочник.КонтрольныеПроцедуры КАК КонтрольныеПроцедуры
    |ЛЕВОЕ СОЕДИНЕНИЕ
    |   РегистрСведений.НастройкиКонтрольПодключений КАК Настройки
    |ПО
    |   Настройки.КонтрольнаяПроцедура = КонтрольныеПроцедуры.Ссылка
    |ЛЕВОЕ СОЕДИНЕНИЕ
    |   РегистрСведений.БезопасноеХранилище КАК БезопасноеХранилище
    |ПО
    |   БезопасноеХранилище.ВладелецХранилища = КонтрольныеПроцедуры.Ссылка   
    |ГДЕ
    |   ОбъектКонтроля В (&ИнформационныеБазы)
    |   И КонтрольныеПроцедуры.Владелец = &КонтрольПодключений
    |";
    
    Запрос.УстановитьПараметр("ИнформационныеБазы", ИнформационныеБазыМассив);
    Запрос.УстановитьПараметр("КонтрольПодключений", Справочники.ВидыКонтрольныхПроцедур.КонтрольПодключений());
    Запрос.УстановитьПараметр("ПустаяСтрока", "");
        
    УстановитьПривилегированныйРежим(Истина);
    Результат = Запрос.Выполнить();
    УстановитьПривилегированныйРежим(Ложь);
    
    ПараметрыКонтроля = Новый Массив;
    
    Выборка = Результат.Выбрать();
    Пока Выборка.Следующий() Цикл
        
        ПараметрКонтроля = Новый Структура("InfoBase, URL, Param1, Param2");
        ПараметрКонтроля.InfoBase = Строка(Выборка.ИнформационнаяБаза.УникальныйИдентификатор());
        
        Если СтрЗаканчиваетсяНа(Выборка.URL, "/") Тогда
            ПараметрКонтроля.URL = Выборка.URL + "ws/RemoteControl";
        Иначе
            ПараметрКонтроля.URL = Выборка.URL + "/ws/RemoteControl";
        КонецЕсли;
        
        Если ЗначениеЗаполнено(Выборка.ДанныеХранилища) Тогда
            ДанныеХранилища = Выборка.ДанныеХранилища.Получить();
        Иначе
            ДанныеХранилища = Новый Структура("ЛогинПриПодключении, ПарольПриПодключении", "", "");
        КонецЕсли;
        
        ПараметрКонтроля.Param1 = ДанныеХранилища.ЛогинПриПодключении;
        ПараметрКонтроля.Param2 = ДанныеХранилища.ПарольПриПодключении;
        
        ПараметрыКонтроля.Добавить(ПараметрКонтроля);
        
    КонецЦикла;
    
    Возврат ПараметрыКонтроля;
            
КонецФункции

#КонецОбласти

#КонецЕсли
